WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/pwrmgmt/pwrmgmt_use_lsi_for_rtc.c
static int pwrmgmt_lsi_init_timer_5_for_measuring(void);
static int pwrmgmt_create_lsi_calc_thread(void);
static void *pwrmgmt_lsi_calc_prep_thread_func(int argc, char *argv[]);
static int pwrmgmt_lsi_calculate_lsi_clock_freq(double *lsiMeasuredFreq);
static int pwrmgmt_lsi_calc_rtc_prescaler_values(double lsiMeasuredFreq, uint8_t *PreDivA, uint16_t *PreDivS);
static int pwrmgmt_switch_rtc_as_per_args(uint32_t clkSrc, uint32_t rtcPrer);

/****************************************************************************
 * Private Functions
 ****************************************************************************/
#if HCOM_INCLUDE_PWR_MGMT_TESTS_IN_BUILD > 0

static void pwrmgmt_rtc_dumpregs(FAR const char *msg)
{
  int rtc_state;

  // RTC control register (RTC_CR)                    [reset to 0]
  // RTC prescaler register (RTC_PRER)                [reset to 0x007f00ff the LSE default]
  // RTC calibration register (RTC_CALR)              [reset to 0]
  // RTC shift register (RTC_SHIFTR)                  [reset to 0]
  // RTC timestamp register (RTC_TSSSR)               [reset to 0]
  // RTC timestamp register (RTC_TSTR)                [reset to 0]
  // RTC timestamp register (RTC_TSDR)                [reset to 0]
  // RTC tamper configuration register (RTC_TAMPCR)   [reset to 0]
  // RTC backup registers (RTC_BKPxR)                 [all 32 registers reset to 0]
  // RTC wakeup timer register (RTC_WUTR)             [reset to 0]
  // RTC Alarm A registers (RTC_ALRMASSR/RTC_ALRMAR)  [reset both to 0]
  // RTC Alarm B registers (RTC_ALRMBSSR/RTC_ALRMBR)  [reset both to 0]
  // RTC Option register (RTC_OR)                     [reset to 0]

  syslog(1, "%s:\n", msg);
  syslog(1, "Registers set to default by Backup Domain Reset\n");
  syslog(1, "  RTC_CR: %08x\n", getreg32(STM32_RTC_CR));
  syslog(1, "    PRER: %08x\n", getreg32(STM32_RTC_PRER));
  syslog(1, "    CALR: %08x\n", getreg32(STM32_RTC_CALR));
  syslog(1, "  SHIFTR: %08x\n", getreg32(STM32_RTC_SHIFTR));
  syslog(1, "   TSSSR: %08x\n", getreg32(STM32_RTC_TSSSR));
  syslog(1, "    TSTR: %08x\n", getreg32(STM32_RTC_TSTR));
  syslog(1, "    TSDR: %08x\n", getreg32(STM32_RTC_TSDR));
  syslog(1, "  TAMPCR: %08x\n", getreg32(STM32_RTC_TAMPCR));
  syslog(1, "    WUTR: %08x\n", getreg32(STM32_RTC_WUTR));
  syslog(1, "ALRMASSR: %08x\n", getreg32(STM32_RTC_ALRMASSR));
  syslog(1, "  ALRMBR: %08x\n", getreg32(STM32_RTC_ALRMBR));
  syslog(1, "ALRMBSSR: %08x\n", getreg32(STM32_RTC_ALRMBSSR));
  syslog(1, "  ALRMAR: %08x\n", getreg32(STM32_RTC_ALRMAR));
  syslog(1, "Other RTC Registers\n");
  syslog(1, "TR(time): %08x\n", getreg32(STM32_RTC_TR));
  syslog(1, "DR(date): %08x\n", getreg32(STM32_RTC_DR));
  syslog(1, "     ISR: %08x\n", getreg32(STM32_RTC_ISR));
  syslog(1, "MAGICREG: %08x\n", getreg32(RTC_MAGIC_REG));

  rtc_state =
    ((getreg32(STM32_EXTI_RTSR) & EXTI_RTC_ALARM) ? 0x1000 : 0) |
    ((getreg32(STM32_EXTI_FTSR) & EXTI_RTC_ALARM) ? 0x0100 : 0) |
    ((getreg32(STM32_EXTI_IMR)  & EXTI_RTC_ALARM) ? 0x0010 : 0) |
    ((getreg32(STM32_EXTI_EMR)  & EXTI_RTC_ALARM) ? 0x0001 : 0);
  syslog(1, "EXTI (RTSR FTSR ISR EVT): %01x\n",rtc_state);
}
#endif

//=============================================================
// This ISR is only used to measure the LSI frequency for a moment
static int pwrmgmt_lsi_use_isr_lsi_clock(int irq, void *context, void *arg)
{  
  uint16_t timStatusReg = getreg16(STM32_TIM5_SR);

  // Get interrupt on rising edge
  if(timStatusReg & GTIM_SR_CC4IF)
  {
    timStatusReg &= ~GTIM_SR_CC4IF;
  
    uint32_t currentCount = getreg32(STM32_TIM5_CCR4);

    // Roll over? If it did ignore data
    if(currentCount > _prevISRCount)
    {
      // No, didn't roll over save count for non-isr processing
      _elapsedCount = currentCount - _prevISRCount;
    }

    _prevISRCount = currentCount;
  }

  putreg16(timStatusReg, STM32_TIM5_SR);
  return OK;
}

//=============================================================
// Enable timer 5 for calibration
static void pwrmgmt_lsi_enable_timer_5(void)
{
  uint16_t cr1Val = getreg16(STM32_TIM5_CR1);
  cr1Val |= GTIM_CR1_CEN;
  
  uint16_t egrVal = getreg16(STM32_TIM5_EGR);
  egrVal |= GTIM_EGR_UG;

  putreg16(egrVal, STM32_TIM5_EGR);
  putreg16(cr1Val, STM32_TIM5_CR1);
}

//=============================================================
// Disable timer 5 for calibration
static void pwrmgmt_lsi_disable_timer_5(void)
{
  uint16_t regval = getreg16(STM32_TIM5_CR1);
  regval &= ~ATIM_CR1_CEN;
  putreg16(regval, STM32_TIM5_CR1);
}

//=============================================================
static void rtc_wprunlock(void)
{
  // Sets the PWR_CR1_DBP bit in the STM32_PWR_CR1_OFFSET register
  // Ref Man 4.4.1 PWR power control register (PWR_CR1)
  stm32_pwr_enablebkp(true);

  // Enable write access to RTC Registers
  putreg32(0xca, STM32_RTC_WPR);
  putreg32(0x53, STM32_RTC_WPR);
}

//=============================================================
static inline void rtc_wprlock(void)
{
  // Disable write access to RTC Registers
  putreg32(0xff, STM32_RTC_WPR);

  // Clears the PWR_CR1_DBP bit in the STM32_PWR_CR1_OFFSET register
  // Ref Man 4.4.1 PWR power control register (PWR_CR1)
  stm32_pwr_enablebkp(false);
}

//=============================================================
static int rtc_synchwait(void)
{
  volatile uint32_t timeout;
  uint32_t regval;
  int ret;

  /* Disable the write protection for RTC registers */

  rtc_wprunlock();

  /* Clear Registers synchronization flag (RSF) */

  regval  = getreg32(STM32_RTC_ISR);
  regval &= ~RTC_ISR_RSF;
  putreg32(regval, STM32_RTC_ISR);

  /* Now wait the registers to become synchronised */

  ret = -ETIMEDOUT;
  for (timeout = 0; timeout < 20000; timeout++)
    {
      regval = getreg32(STM32_RTC_ISR);
      if ((regval & RTC_ISR_RSF) != 0)
        {
          /* Synchronized */

          ret = OK;
          break;
        }
    }

  /* Re-enable the write protection for RTC registers */

  rtc_wprlock();
  return ret;
}

//=============================================================
// Set RTC_ISR_INIT bit in STM32_RTC_ISR and wait for RTC_ISR_INITF bit
static int rtc_enterinit(void)
{
  volatile uint32_t timeout;
  uint32_t regval;
  int ret;

  // Check if the Initialization mode is already set
  regval = getreg32(STM32_RTC_ISR);

  ret = OK;
  // RTC_ISR_INITF bit = 1 means calendar register update allowed
  if ((regval & RTC_ISR_INITF) == 0)
  {
    // Set the Initialization mode bit
    putreg32(RTC_ISR_INIT, STM32_RTC_ISR);

    // Wait until the RTC is in the INIT state (or a timeout occurs)
    ret = -ETIMEDOUT;
    for (timeout = 0; timeout < 10000; timeout++)
    {
      regval = getreg32(STM32_RTC_ISR);

      // Loop till calendar register update allowed (i.e. not 0)
      if ((regval & RTC_ISR_INITF) != 0)
      {
        ret = OK;
        break;
      }
    }
  }
  else
  {
    MEADOW_TRACE_DEBUG("===> rtc_enterinit() on Entry found RTC_ISR_INITF == 0\n");
  }

  return ret;
}

