WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/pwrmgmt/pwrmgmt_use_lsi_for_rtc.c
//=============================================================
static void rtc_exitinit(void)
{
  uint32_t regval;

  regval = getreg32(STM32_RTC_ISR);
  regval &= ~(RTC_ISR_INIT);
  putreg32(regval, STM32_RTC_ISR);

  return;
}

//=============================================================
static void pwrmgmt_rtc_resume(void)
{
#ifdef CONFIG_RTC_ALARM
  uint32_t regval;

  // Clear the RTC alarm flags
  regval  = getreg32(STM32_RTC_ISR);
  regval &= ~(RTC_ISR_ALRAF | RTC_ISR_ALRBF);
  putreg32(regval, STM32_RTC_ISR);

  /* Clear the RTC Alarm Pending bit */

  putreg32(EXTI_RTC_ALARM, STM32_EXTI_PR);
#endif
}

//====================================================================
// This function is called during startup. It is responsible for finding the
// LSI clock frequency and the needed factors for calibrating the RTC hardware.
// This function creates a thread so the rest of the initialization
// isn't stalled waiting for this to finish. Why not do this on demand? Because
// this requires Timer 5 to be setup a special way. And at runtime timer 5 has
// other responsibilites.
int pwrmgmt_init_lsi_for_rtc(void)
{
  int ret;

  _hseRtcPrer = 0;
  _lsiRtcPrer = 0;
#if HCOM_INCLUDE_PWR_MGMT_TESTS_IN_BUILD > 0
  _dbgClkSwitched = false;
#endif

  // This call will initialize and enable timer 5 which is the only one that
  // can be used to measure the LSI's frequency. It will also turn-on the LSI
  // clock.
  ret = pwrmgmt_lsi_init_timer_5_for_measuring();
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-LSI init TIM5 failed:%d\n", thisFile, __LINE__, ret);
    return ret;
  }

  // Create a thread to do the calibration work. The results will be stored in
  // a battery backed register.
  ret = pwrmgmt_create_lsi_calc_thread();
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-LSI calc freq failed:%d\n", thisFile, __LINE__, ret);
    return ret;
  }
  
  return ret;
}

//=====================================================================
// Create a thread to do the early initialization
int pwrmgmt_create_lsi_calc_thread()
{
  // Create a thread to use for experimenting
  _pwrmgmt_lsi_calc_thread_id = kthread_create(PWRMGMT_CAL_LSI_THREAD_NAME,
                                  PWRMGMT_CAL_LSI_THREAD_PRIORITY,
                                  PWRMGMT_CAL_LSI_THREAD_STACKSIZE,
                                  (main_t) pwrmgmt_lsi_calc_prep_thread_func,
                                  (char *const *) NULL);
  if (_pwrmgmt_lsi_calc_thread_id <= 0)
  {
    syslog(LOG_ERR, "%s@%d-Creation of %s kthread FAILED\n",
              thisFile, __LINE__, PWRMGMT_CAL_LSI_THREAD_NAME);
    return -ENOEXEC;
  }

  return OK;
}

//=============================================================
// This thread function will calculate the calibration needed for the LSI
// clocks timing error. It is called before entering the low-power mode.
void *pwrmgmt_lsi_calc_prep_thread_func(int argc, char *argv[])
{
  int ret;
  double lsiMeasuredFreq;
  uint8_t PreDivA = 0;
  uint16_t PreDivS = 0;
  uint32_t rtcPrer;

  // Under some undetermined conditions RTC pre-scaler could become 0x007f00ff
  // while Nuttx is using the HSE clock. A 0x007f00ff is the correct
  // pre-scaler for LSE clock, which we cannot use. Meaning that this
  // pre-scaler value is way wrong! This patch corrects this error.
  rtcPrer = getreg32(STM32_RTC_PRER);
  if(rtcPrer == 0x007f00ff)
  {
    MEADOW_TRACE_DEBUG("At startup detected wrong pre-scaler:0x%08x\n", rtcPrer);

    // Unlock RTC registers
    rtc_wprunlock();
    ret = rtc_enterinit();
    if(ret == -ETIMEDOUT)
    {
      syslog(LOG_ERR, "%s@%d-STARTUP->RTC INIT state timed out\n", thisFile, __LINE__);
      return NULL;
    }

    // Hardcoded HSE pre-scaler values.
    rtcPrer = (uint32_t)PWRMGMT_LSI_HSE_DIV_S_FACTOR_FOR_1_MHZ << RTC_PRER_PREDIV_S_SHIFT |
               (uint32_t)PWRMGMT_LSI_HSE_DIV_A_FACTOR_FOR_1_MHZ << RTC_PRER_PREDIV_A_SHIFT;
    putreg32(rtcPrer, STM32_RTC_PRER);

    rtc_exitinit();
    rtc_wprlock();
  }

#if defined(USE_MEADOW_DEBUG_HELPERS)
  uint32_t clkSrc = getreg32(STM32_RCC_BDCR) & RCC_BDCR_RTCSEL_MASK;
  uint32_t rtcPRER = getreg32(STM32_RTC_PRER);
  uint32_t rtcPrerDBG = (uint32_t)PWRMGMT_LSI_HSE_DIV_S_FACTOR_FOR_1_MHZ << RTC_PRER_PREDIV_S_SHIFT |
                (uint32_t)PWRMGMT_LSI_HSE_DIV_A_FACTOR_FOR_1_MHZ << RTC_PRER_PREDIV_A_SHIFT;
  MEADOW_TRACE_DEBUG(">>> At startup, clkSrc:0x%08x, rtc pre-scaler:0x%08x and HSE default:0x%08x\n",
            clkSrc, rtcPRER, rtcPrerDBG);
#endif

  ret = pwrmgmt_lsi_calculate_lsi_clock_freq(&lsiMeasuredFreq);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-LSI clock average error\n", thisFile, __LINE__);
    return NULL;
  }

  // Finshed with Timer 5
  up_disable_irq(STM32_IRQ_TIM5);

  pwrmgmt_lsi_disable_timer_5();

  // We have the LSI frequency. Next find the pre-scaler factors that yield
  // the desired divisor needed for this frequency.
  ret = pwrmgmt_lsi_calc_rtc_prescaler_values(lsiMeasuredFreq,
            &PreDivA, &PreDivS);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-LSI clock pre-scaler calc error\n", thisFile, __LINE__);
    return NULL;
  }

  MEADOW_TRACE_DEBUG("FREQ Calc1->Correct pre-scaler values are PreDivA:%u(0x%08x), PreDivS:%u(0x%08x), product:%u\n",
            PreDivA, PreDivA, PreDivS, PreDivS, PreDivA * PreDivS);

  // We have the pre-scaler factors needed to do the calibration
  // Convert PreDivA and PreDivS to the 32-bit value that will be written
  // to the RTC_PRER register.
  _lsiRtcPrer = (uint32_t)PreDivS << RTC_PRER_PREDIV_S_SHIFT |
          (uint32_t)PreDivA << RTC_PRER_PREDIV_A_SHIFT;

  up_disable_irq(STM32_IRQ_TIM5);
  
#if PWRMGMT_LSI_CLOCK_OFF_TILL_NEEDED > 0
  MEADOW_TRACE_DEBUG("Turning LSI Clock off")
  // Turn-off LSI clock until needed
  modifyreg32(STM32_RCC_CSR, RCC_CSR_LSION, 0);
#endif

#if PWRMGMT_LSI_SHOW_RTC_TIME_FOR_TESTING > 0
  //---------------------------------------------------------------------
  // If tests are enabled, this thread won't exit when calibration is completed
  //

  struct tm tmNow;
  int nextSec = 0;
  int secondCount = 0;
  int errorCount = 0;
  int statusSecond = 0;
  char *clkName = "";
  uint32_t clkSrc;

  // First switch to the LSI or HSE clock. If neither of these functions are
  // called  then the Nuttx default clock will be used, probably HSE.
  //
  // ret = pwrmgmt_use_as_rtc_clock_source_lsi();
  ret = pwrmgmt_use_as_rtc_clock_source_hse();
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-Switching to HSE/LSI failed\n", thisFile, __LINE__);
    return NULL;
  }

