WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/pwrmgmt/pwrmgmt_use_lsi_for_rtc.c
  // Since we know the clock frequency of Timer 5 and the average number of
  // counts between the LSI clock's rising edges we have everything we need.
  *lsiMeasuredFreq = (double)(PWRMGMT_LSI_TIMER_5_BASE_CLOCK_FREQ) / (double) (totCount/freqCount);
  
  MEADOW_TRACE_DEBUG("LSI Average Frequency:%06.03f\n", *lsiMeasuredFreq);

  return OK;
}

//================================================================
// In STMicro's AN4759 Rev 7 section 2.1.4 there is a brief section on
// adjusting the RTC clock to match the input frequency of the reference
// clock, LSI in our case. There are 2 factors needed and the product
// of these 2 factors equal the frequency being measured. Doing this will
// result in a RTC clock frequency of 1 Hz.
// The following code finds these 2 factors, however, the factors needed by
// the MCU's hardware needs both factors to be 1 less than calculated.
int pwrmgmt_lsi_calc_rtc_prescaler_values(double lsiMeasuredFreq,
          uint8_t *PreDivA, uint16_t *PreDivS)
{
  // int ret;
  uint8_t preDivA;
  uint16_t initialPreDivS;
  uint16_t chkOffset;
  uint16_t chkDiff = 0xffff;
  uint16_t smallestDiff = 0xffff;
  uint8_t smallestDivA = 127;
  uint16_t smallestDivS = 255;
  uint16_t lsiTargetFreq = (uint32_t)round(lsiMeasuredFreq);

   MEADOW_TRACE_DEBUG("Entered Find Pre-scaler value() lsiMeasuredFreq:%.3f as uint32:%lu\n",
          lsiMeasuredFreq, lsiTargetFreq);

  // LSI frequency already perfect?
  if(lsiMeasuredFreq == (double)PWRMGMT_LSI_CAL_TARGET_FREQUENCY)
  {
    // Use the default values
     MEADOW_TRACE_DEBUG("**Perfect:%u**\n", lsiMeasuredFreq);
    *PreDivA = 127;
    *PreDivS = 255;
    return OK;
  }

  // We'll solve this with 2 loops. The outer loop counts from 127 (PREDIVA)
  // to 1 and the inner loop for the PREDIVS, which is typically around 512. The
  // goal is to find the largest PREDIVA, that when multiplied by PREDIVS
  // results in a value as close as possible to the lsiMeasuredFreq. This will
  // result in the RTC receiving, as close as possible, the needed 1Hz clock.
  for (preDivA = 127; preDivA >= 2; preDivA--)
  {    
    // To be thorough check above and below our initial guess too
    initialPreDivS = (lsiTargetFreq / preDivA) + 2;   // Start above

    // Is this closest to our average frequency target (i.e. smallest
    // difference)?
    for (chkOffset = 0; chkOffset <  4; chkOffset++)
    {  
      chkDiff = (preDivA * initialPreDivS) - lsiTargetFreq;
      if(chkDiff < smallestDiff)
      {
         MEADOW_TRACE_DEBUG("*** New smallest - chkOffset:%u, A(%03u) * S(%04u) = %05lu (dif:%03u)\n",
                chkOffset, preDivA, initialPreDivS, preDivA * initialPreDivS, chkDiff);

        // Save values of the new smallest error
        smallestDiff = chkDiff;
        smallestDivA = preDivA;
        smallestDivS = initialPreDivS;

        // Did we find a perfect combination (i.e. prime factors)?
        if(smallestDiff == 0)
          break;
      }

      initialPreDivS--;   // Move down for this PREDIVA
    }

    if(smallestDiff == 0)
      break;
  }

  MEADOW_TRACE_DEBUG("Final PreDivA:%u, PreDivS:%u, (product:%u), target:%.3f\n",
            smallestDivA,
            smallestDivS,
            smallestDivA * smallestDivS,
            lsiMeasuredFreq);

  // Per STM documents a DivA of 0x7f and a DevS of 0xff is perfect for 32,768
  // HZ. And the product of 128 * 256 = 32768. Therefore, 1 must be subtracted
  // from both of the below factors to compensate for the hardware adding 1.
  *PreDivA = (uint8_t)smallestDivA - 1;
  *PreDivS = (uint16_t)smallestDivS - 1;
  return OK;
}

//=============================================================
// Public Function to restore the RTC source to HSE
int pwrmgmt_use_as_rtc_clock_source_hse()
{
  int ret;

#ifndef CONFIG_STM32F7_RTC_HSECLOCK
#  error "CONFIG_STM32F7_PWR must selected to use this driver"
#endif

  // What clock source is currently in use?
  uint32_t initClkSrc = getreg32(STM32_RCC_BDCR) & RCC_BDCR_RTCSEL_MASK;
  MEADOW_TRACE_DEBUG("--> Setting clock to HSE, from %s\n",
            initClkSrc == RCC_BDCR_RTCSEL_HSE ? "HSE" : "LSI");
  
  // If the current clock source is hse we'll save the RTC_PRER value
  if(initClkSrc == RCC_BDCR_RTCSEL_HSE)
  { 
    // Has the HSE pre-scaler already been saved?
    if(_hseRtcPrer == 0)
    {
      // If not previously saved, read it now
      _hseRtcPrer = getreg32(STM32_RTC_PRER);
      if(_hseRtcPrer == 0)
      {
        syslog(LOG_ERR, "%s@%d-ERROR:HSE clock source but no pre-scaler\n", thisFile, __LINE__);
        return -1;
      }
    }

    // Since this is HSE there's nothing to do
    MEADOW_TRACE_DEBUG("Call to switch to HSE but already HSE. Exiting!\n");
    return  OK;   // Nothing to do
  }
  else
  {
    // Since the clock source is not HSE we are forced to use the hardcoded
    // values found in /arch/arm/src/stm32f7/stm32_rtc.c @510.
    _hseRtcPrer = (uint32_t)PWRMGMT_LSI_HSE_DIV_S_FACTOR_FOR_1_MHZ << RTC_PRER_PREDIV_S_SHIFT |
              (uint32_t)PWRMGMT_LSI_HSE_DIV_A_FACTOR_FOR_1_MHZ << RTC_PRER_PREDIV_A_SHIFT;

    MEADOW_TRACE_DEBUG("Switching to HSE using hardcoded pre-scaler\n");
  }

  // Let a more generic function do the heavy lifting
  ret = pwrmgmt_switch_rtc_as_per_args(RCC_BDCR_RTCSEL_HSE, _hseRtcPrer);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-HSE clock pre-scaler set error\n", thisFile, __LINE__);
    return -1;
  }

#if PWRMGMT_LSI_CLOCK_OFF_TILL_NEEDED > 0
  MEADOW_TRACE_DEBUG("Turning LSI Clock off")

  // Turn-off LSI clock until needed
  modifyreg32(STM32_RCC_CSR, RCC_CSR_LSION, 0); // Turn-off
#endif


  return OK;
}

//=============================================================
// Public Function to restore the RTC source to LSI
int pwrmgmt_use_as_rtc_clock_source_lsi()
{
  int ret;
  // Read current clock source
  uint32_t initClkSrc = getreg32(STM32_RCC_BDCR) & RCC_BDCR_RTCSEL_MASK;
  MEADOW_TRACE_DEBUG("--> Setting clock to LSI, from %s\n",
          initClkSrc == RCC_BDCR_RTCSEL_LSI ? "LSI" : "HSE");

