WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/pwrmgmt/pwrmgmt_use_lsi_for_rtc.c
  // If the current clock source is hse we'll save the RTC_PRER value
  if(initClkSrc == RCC_BDCR_RTCSEL_HSE)
  {
    if(_hseRtcPrer == 0)
    {
      // Since the current clock is HSE we can save the pre-scaler (RTC_PRER) 
      _hseRtcPrer = getreg32(STM32_RTC_PRER);
      if(_hseRtcPrer == 0)
      {
        syslog(LOG_ERR, "%s@%d-ERROR:HSE clock source but no pre-scaler\n", thisFile, __LINE__);
        return -1;
      }
    }
  }

  // If the current value in STM32_RCC_BDCR indicates that HSE is
  // in use we'll copy it's STM32_RTC_PRER value so we can restore it later.
  if(initClkSrc == RCC_BDCR_RTCSEL_LSI)
  {
    MEADOW_TRACE_DEBUG("Call to switch to LSI but already LSI. Exiting!\n");
    return OK;
  }

  // The LSI clock's frequency should have already been measured and the
  // needed calibration factors saved in _lsiRtcPrer at startup.
  if(_lsiRtcPrer == 0)
  {
    syslog(LOG_ERR, "%s@%d-LSI BBR pre-scaler value is 0. It must be set\n", thisFile, __LINE__);
    return -1;
  }

  // Switch to LSI clock for RTC timing.
  ret = pwrmgmt_switch_rtc_as_per_args(RCC_BDCR_RTCSEL_LSI, _lsiRtcPrer);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-ERROR:Switching to LSI failed\n", thisFile, __LINE__);
    return -1;
  }

#if PWRMGMT_LSI_CLOCK_OFF_TILL_NEEDED > 0
  MEADOW_TRACE_DEBUG("Turning LSI Clock on")

  // Turn-on the Low-Speed Internal (LSI) RC Oscillator
  modifyreg32(STM32_RCC_CSR, 0, RCC_CSR_LSION);

  // Wait for the internal RC oscillator to become stable.
  while ((getreg32(STM32_RCC_CSR) & RCC_CSR_LSIRDY) == 0);
#endif

  // // Set wake up time
  // struct alm_setalarm_s alminfo;
  // alminfo.as_id = RTC_ALARMA; // or RTC_ALARMB
  // alminfo.as_time = tmAlarm;  // Alarm time
  // alminfo.as_cb = NULL;       // Callback
  // alminfo.as_arg = NULL;      // Callback arguments

  // ret = stm32_rtc_setalarm(&alminfo);
  // if(ret < 0)
  // {
  //   syslog(LOG_ERR, "%s@%d-Error:Setting alarm time failed, ret:%d\n",
  //          thisFile, __LINE__, ret);
  //   return ret;
  // }

  // Clock is ready for low-power  
  return OK;
}

//=============================================================
// Set up RTC to use the LSI Clock
// RCC_BDCR_RTCSEL_HSE or RCC_BDCR_RTCSEL_LSI supported
int pwrmgmt_switch_rtc_as_per_args(uint32_t clkSrc, uint32_t rtcPrer)
{
  int ret;
  uint32_t regval;

  // Enable write access to backup domain
  stm32_pwr_enablebkp(true);

  // Save time and date
  uint32_t tr_bkp = getreg32(STM32_RTC_TR);
  uint32_t dr_bkp = getreg32(STM32_RTC_DR);

  // Save the Battery Backed Registers we know about
  // This is the value Nuttx uses in stm32_rtc.c to determine if the clock
  // has been initialized. Therefore, we must save and restore it here.
  uint32_t saveMagicRegi = getreg32(RTC_MAGIC_REG);
  // A patch was made to stm32_rtc.c @991 so if LSI is the selected clock and
  // Meadow is rebooted, the Meadow BBR won't be lost.
  uint32_t saveMeadowReg = getreg32(HCOM_NX_MEADOW_BATTERY_BACKED_REGISTER);
  // The UTC offset is not saved within stm32_rtc.c during a reset because the
  // RTC will loose all it's time values, so no reason to save the UTC offset.
  uint32_t saveUtcOffReg = getreg32(MEADOW_BATTERY_BACKED_REG_RTC_UTC_OFFSET);

  // A reset of the backup domain is required to switch clocks.
  // This action resets the following registers to these defaults.
  // RTC control register (RTC_CR)                    [0]
  // RTC prescaler register (RTC_PRER)                [0x007f00ff the LSE default]
  // RTC calibration register (RTC_CALR)              [0]
  // RTC shift register (RTC_SHIFTR)                  [0]
  // RTC timestamp register (RTC_TSSSR)               [0]
  // RTC timestamp register (RTC_TSTR)                [0]
  // RTC timestamp register (RTC_TSDR)                [0]
  // RTC tamper configuration register (RTC_TAMPCR)   [0]
  // RTC backup registers (RTC_BKPxR)                 [all 32 registers reset to 0]
  // RTC wakeup timer register (RTC_WUTR)             [0x0000FFFF]
  // RTC Alarm A registers (RTC_ALRMASSR/RTC_ALRMAR)  [both to 0]
  // RTC Alarm B registers (RTC_ALRMBSSR/RTC_ALRMBR)  [both to 0]
  // RTC Option register (RTC_OR)                     [0]
  //
  modifyreg32(STM32_RCC_BDCR, 0, RCC_BDCR_BDRST);
  modifyreg32(STM32_RCC_BDCR, RCC_BDCR_BDRST, 0);

  // Switch to the requested clock as the input to the RTC block
  modifyreg32(STM32_RCC_BDCR, RCC_BDCR_RTCSEL_MASK, clkSrc);
  modifyreg32(STM32_RCC_BDCR, 0, RCC_BDCR_RTCEN);

  // Loop, attempting to initialize/resume the RTC. This loop is necessary
  // because it seems that occasionally it takes longer to initialize the
  // RTC (the actual failure is in rtc_synchwait()).
  int maxretry = 100;
  int nretry = 0;
  do
    {
      //Wait for the RTC Time and Date registers to be synchronized with
      //RTC APB clock.
      ret = rtc_synchwait();

      /* Check that rtc_syncwait() returned successfully */

      switch (ret)
        {
          case OK:
            {
              rtcinfo("rtc_syncwait() okay\n");
              break;
            }

          default:
            {
              rtcerr("ERROR: rtc_syncwait() failed (%d)\n", ret);
              break;
            }
        }
    }
  while (ret != OK && ++nretry < maxretry);

  // Clear the RTC alarm flags and clear pending alarm
  pwrmgmt_rtc_resume();

  // Lock backup domain
  stm32_pwr_enablebkp(false);

  if (ret != OK && nretry > 0)
  {
    syslog(LOG_ERR, "%s@%d-init/resume ran %d times and failed with %d\n",
              thisFile, __LINE__, nretry, ret);
    return -ETIMEDOUT;
  }

  // Unlock RTC registers for writing
  rtc_wprunlock();

  // Enter the RTC initialization mode. Required for changes to RTC_TR, RTC_DR
  // and RTC_PRER
  ret = rtc_enterinit();
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-Error: rtc_enterinit() returned %d\n",
              thisFile, __LINE__, ret);
  }
  else
  {
    // Set the 24 hour format by clearing the FMT bit in the RTC control register
    regval = getreg32(STM32_RTC_CR);
    regval &= ~RTC_CR_FMT;
    putreg32(regval, STM32_RTC_CR);

    // Write the 2 pre-scaler values that calibrate the RTC for the desired
    // clock. These values (PREDIV_A 22:16 and PREDIV_S 14:0) have already been
    // pre-combined.
    putreg32(rtcPrer, STM32_RTC_PRER);

    // Restore time and date
    putreg32(tr_bkp, STM32_RTC_TR);
    putreg32(dr_bkp, STM32_RTC_DR);

    rtc_exitinit();
  }

  rtc_wprlock();

  // Restore Battery Backed Registers
  putreg32(saveMagicRegi, RTC_MAGIC_REG);
  putreg32(saveUtcOffReg, MEADOW_BATTERY_BACKED_REG_RTC_UTC_OFFSET);
  putreg32(saveMeadowReg, HCOM_NX_MEADOW_BATTERY_BACKED_REGISTER);

#if HCOM_INCLUDE_PWR_MGMT_TESTS_IN_BUILD > 0
  _dbgClkSwitched = true;
#endif

  return OK;
}

#endif  // #if defined (CONFIG_MEADOW_PWR_MGMT_SUPPORT)
